In [1]:
import pandas as pd
import numpy as np

In [2]:
data={'eng':[10,30,50,70],'kor':[20,40,60,80],'math':[90,50,20,70]}
df=pd.DataFrame(data,index=['a','b','c','d',])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [3]:
df['eng']#시리즈는 인덱스로 데이터프레임은 컬럼명으로

a    10
b    30
c    50
d    70
Name: eng, dtype: int64

In [4]:
df[["eng","math"]]

   eng  math
a   10    90
b   30    50
c   50    20
d   70    70

In [5]:
df[0:3]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [7]:
df["a":"c"]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [8]:
df.iloc[0]

eng     10
kor     20
math    90
Name: a, dtype: int64

In [10]:
df.iloc[0,0]

10

In [11]:
df.iloc[1:]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [12]:
df.iloc[[0,2,3]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [13]:
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [14]:
df.loc['b':]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [15]:
df.loc['a','eng']

10

In [16]:
df.loc['b':,'kor':]

   kor  math
b   40    50
c   60    20
d   80    70

In [17]:
df.loc[['a','b','d']]

   eng  kor  math
a   10   20    90
b   30   40    50
d   70   80    70

In [18]:
df.loc[['a','b','d'],['eng','math']]

   eng  math
a   10    90
b   30    50
d   70    70

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70